## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.roleassignment-spn-sa.azurerm_role_assignment.RBAC-AZTF-uami will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c45e89ca-8212-45e9-8b55-f26b6040f9aa"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.roleassignment-spn-sa-2.azurerm_role_assignment.RBAC-AZTF-uami will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3ee74291-276c-4ffc-8475-52144540279c"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.roleassignment-spn-sa-3.azurerm_role_assignment.RBAC-AZTF-uami will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "020a600a-b308-48ab-b860-ab7180455478"
      + principal_type                   = "User"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.roleassignment-spn-sa-4.azurerm_role_assignment.RBAC-AZTF-uami will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3ee74291-276c-4ffc-8475-52144540279c"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.roleassignment-spn-sa-5.azurerm_role_assignment.RBAC-AZTF-uami will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c45e89ca-8212-45e9-8b55-f26b6040f9aa"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sa.azurerm_storage_account_customer_managed_key.cmk-logs will be created
  + resource "azurerm_storage_account_customer_managed_key" "cmk-logs" {
      + id                        = (known after apply)
      + key_name                  = "kv-aztf-log-prod-ne-001-kek"
      + key_vault_id              = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.KeyVault/vaults/kv-aztf-log-prod-ne-03"
      + key_vault_uri             = (known after apply)
      + storage_account_id        = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02"
      + user_assigned_identity_id = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uami-aztf-log-prod-ne-02"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>